<?php
$name = 'Вычисления';
$page2 = '2.php';
$page3 = '3.php';
$page0 = 'index.php';
?>
<doctype html>
    <html>
    <head>
        <title><?= $name ?></title>
    </head>
       <body>
       <? echo "<h2> $name </h2>";?>
       <?php
       $a = 12;
       $b = 13;
       $z1 = 'Сумма чисел '. $a. ' и '. $b . ' = ';
       $c1= $z1 . $w=$a+$b;
       $z2 = 'Разность чисел '. $a. ' и '. $b . ' = ';
       $c2= $z2 . $w=$a-$b;
       $z3 = 'Произведение чисел '. $a. ' и '. $b . ' = ';
       $c3= $z3 . $w=$a*$b;
       $z4 = 'Частное чисел '. $a. ' и '. $b . ' = ';
       $c4= $z4 . $w=$a/$b;
       $z5 = '12 степень числа '. $a. ' = ';
       $c5= $z5 . $w=$a**$a;
       $z6 = '13 степень числа '. $b. ' = ';
       $c6= $z6 . $w=$b**$b;
       ?>
        <h3><?= $c1 ?></br>
        <?= $c2 ?></br>
        <?= $c3 ?></br>
        <?= $c4 ?></br>
        <?= $c5 ?></br>
        <?= $c6 ?></h3>
          <ul>
              <li><a href="<?= "$page0" ?>">Вернуться на главную страницу</a></li></br>
              <li><a href="<?= "$page2" ?>">Перейти на страницу 2</a></li></br>
              <li><a href="<?= "$page3" ?>">Перейти на страницу 3</a></li>
          </ul>
         </body>
    </html>

