<?php
$name = 'Манипуляции с числами';
$page1 = '1.php';
$page3 = '3.php';
$page0 = 'index.php';
?>
<doctype html>
    <html>
    <head>
        <title><?= $name ?></title>
    </head>
       <body>
       <? echo "<h2> $name </h2>";?>
       <?php
       $a = "456 jrekngjvnj";
       $b = "969294233720368754775807 hbhbib"
       ?>
        <?php
        $z1 = 'Текстовая переменная: '. $a;
         ?>
         <h3><?= $z1 ?></h3>
         <?php
         $z1 = 'Приводим к числовой переменной: '. (int) $a;
          ?>
         <h3><?= $z1 ?></h3>
         <?php
         $z2 = 'Текстовая переменная: '. $b;
         ?>
         <h3><?= $z2 ?></h3>
         <?php
          $z2 = 'Приводим к числовой переменной: '. (int) $b
          ?>
          <h3><?= $z2 ?></h3>
             <ul>
                 <li><a href="<?= "$page0" ?>">Вернуться на главную страницу</a></li></br>
                 <li><a href="<?= "$page1" ?>">Перейти на страницу 1</a></li></br>
                 <li><a href="<?= "$page3" ?>">Перейти на страницу 3</a></li>
             </ul>
         </body>
    </html>


