<html>
<body>
<?php
$x1=rand(-100, 100);
$x2=rand(-100, 100);
    if ($x1>=0 and $x2>=0) {
        echo('Обе переменные положительные: x1= ' . $x1 . ', x2= ' . $x2);
    }
    if ($x1<0 and $x2<0) {
        echo('Обе переменные отрицательные: x1= ' . $x1 . ', x2= ' . $x2);
    }
        elseif ($x1>=0 and $x2<0) {
            echo ('Переменные неравнозначны : x1= '.$x1.', x2= '.$x2);
    }
        elseif ($x1<0 and $x2>=0) {
            echo ('Переменные неравнозначны : x1= '.$x1.', x2= '.$x2);
        }
        ?>
</body>
</html>
