<html>
<body>

<p> isset проверяет наличие переменной и то, что ее значение отлично от NULL. isset просто скажет,</br>
    установлена ли переменная, независимо от значения (null, false и т. д.). Т.е. вернёт true даже</br>
если переменная равна пустой строке.</br>
empty проверяет наличие переменной, а также, что ее значение отлично от NULL/false/0/array()/etc</br>
(все, что приводится к false). Если мы хотим проверить, что значение не является пустой строкой,</br>
    null, false или 0 используем empty.</p>

<p>В чем отличие между функциями isset() и empty() в PHP?</br>
    Из приведенных выше определений видно, что функции выполняют сходные, но не одинаковые функции.</br>
С помощью этих функций мы можем проверять, является ли переменная нулевой (NULL), истинной (TRUE) или ложной (FALSE),</br>
    а также была ли переменная объявлена.</p>

<p>Когда использовать функцию empty()?
    При использовании empty(), мы можем проверять, является ли переменная ложной (false), но также и то, существует ли</p>
переменная. Эту функцию лучше всего использовать, когда мы хотим убедиться, что переменная существует и имеет значение,</br>
которое не равно false. PHP будет обрабатывать пустые строки, целые числа 0, числа с </br>
плавающей запятой 0.0, пустые массивы и логическое значение false как false. Таким образом, в основном,</br>
используем empty() только тогда, когда хотим убедиться, что в переменной есть какое-то фактическое значение.</p>

<p> Поскольку не нужно объявлять переменные перед их использованием в PHP, можно оказаться в ситуации,</br>
    когда мы пытаемся выполнить действия или запустить другую проверку для переменной, которая еще не была объявлена.</br>
    Хотя по этой и другим причинам рекомендуется объявлять переменные перед использованием, эта ошибка – одна из причин</br>
    того, что empty() используется не так, как isset().</p>
<p>Когда использовать функцию isset()?
    Если используем isset(), то можем специально проверять, была ли переменная уже </br>
    объявлена и что ее значение не равно null. Таким образом, пока есть объявленная переменная,</br>
    у которой установлено значение, но не значение NULL, при тесте получим true. Это хорошее условие для проверки,</br>
    перед выполнением других проверок для выполнения действий с переменной.</p>

</body>
</html>
