<?php
$name = '<h2> Иванов Иван Иванович</h2>';
$address_prop = 'Россия, Чувашская Республика, г.Канаш, пр.Мира, д.25, кв.39';
$address_proj = 'Россия, г.Москва, пр.Ленина, д.5, кв.19';
$age = '29 лет';
$sex = 'Мужской';
$text = '<h1> ФИО пользователя: '. $name . '</h1></br>'. 'Адрес проживания: '. $address_proj.'</br>'.'Адрес прописки: '. $address_prop. '</br>'.'Возраст: '. $age. '</br>'.'Пол: '. $sex. '</br>';
$page2 = '2.php';
$page0 = '/index.php';
?>
<doctype html>
    <html>
    <head>
        <title><?= 'Данные пользователя'?></title>
    </head>
     <body>
     <?= $text ?>
      <ul>
      <li><a href="<?= "$page0"?>">Перейти на главную страницу</a></li></br>
      <li><a href="<?= "$page2"?>">Перейти на страницу 2</a></li>
      </ul>
    </body>
    </html>
